In [4]:
import pandas as pd

In [6]:
df = pd.read_excel('https://github.com/prasertcbs/basic-dataset/blob/master/PisaScore2015.xlsx?raw=true', sheet_name='math')
df.head()

   Rank    Country  Maths
0     1  Singapore    564
1     2  Hong Kong    548
2     3      Macau    544
3     4     Taiwan    542
4     5      Japan    532